[
    {
      "title": "Breast Pain and Breast Cancer Detection: Key Information You Should Know",
      "description": "This blog aims to shed light on the different aspects of breast pain and breast cancer detection, providing you with valuable information to help navigate this sensitive topic.",
      "image": "/images/img1.webp",
      "link": "https://www.plushforher.com/blogs/women-s-health/breast-pain-and-breast-cancer-detection-key-information-you-should-know"
    },
    {
      "title": "How to Know If You're Getting Your First Period",
      "description": "Before diving into the signs of your first period, let's take a moment to understand what the menstrual cycle is all about.",
      "image": "/images/img2.webp",
      "link": "https://www.plushforher.com/blogs/pop-culture/how-to-know-if-youre-getting-your-first-period"
    },
    {
      "title": "Do periods affect your mental health?",
      "description": "It is safe to assume that for most of us periods are not a time that we actively look forward too. They not only put a strain on our physical health with all the cramps and bloating but on our mental health and well being as well.",
      "image": "/images/img3.png",
      "link": "https://www.plushforher.com/blogs/women-s-health/do-periods-affect-your-mental-health-3f?_pos=4&_sid=a7808848b&_ss=r"
    },
    {
        "title": "PCOD vs PCOS",
        "description": "PCOD and PCOS. As young women, we seem to hear these two words quite frequently and more often than not, they are used interchangeably. What is important to understand is they are both types of Poly Cystic ovaries and they are both actually quite different.",
        "image": "/images/img4.png",
        "link": "https://www.plushforher.com/blogs/women-s-health/pcod-vs-pcos?_pos=2&_sid=a7808848b&_ss=r"
    },
    {
        "title": "The Connection Between Gut Health and Your Menstrual Cycle",
        "description": "Your menstrual cycle can be significantly impacted by the condition of your gut. It is true! Despite your lack of awareness, there is a direct connection between your menstrual cycle and your stomach.",
        "image": "/images/img5.webp",
        "link": "https://www.plushforher.com/blogs/women-s-health/the-connection-between-gut-health-and-your-menstrual-cycle"
    },
    {
        "title": "Adolescents and Menstruation: Supporting Teens Through Their First Periods",
        "description": "Navigating the teen years is quite the adventure, isn’t it? There are so many changes and milestones, and one of the big ones for girls is getting their first period.",
        "image": "/images/img6.webp",
        "link": "https://www.plushforher.com/blogs/women-s-health/adolescents-and-menstruation-supporting-teens-through-their-first-periods"
    }
  ]
  